INSERT INTO public.album (title,"year") VALUES
	 ('«Песни из кинофильма „Вертикаль“',1968),
	 ('Песни Владимира Высоцкого',1974),
	 ('Группа крови',1988),
	 ('The Dark Side of the Moon',1973),
	 ('Бунт на корабле',2004),
	 ('Камнем по голове',1996),
	 ('Будь как дома, Путник',1997),
	 ('The Wall',1979);
INSERT INTO public.singer ("name") VALUES
	 ('Владимир Высоцкий'),
	 ('Виктор Цой'),
	 ('Pink Floyd '),
	 ('КиШ');
INSERT INTO genre (title) VALUES
	 ('Русский рок'),
	 ('Зарубежный рок'),
	 ('Авторская песня'),
	 ('Панк-рок');
INSERT INTO public.track (title,duration,album_id) VALUES
	 ('Группа крови','00:04:47',3),
	 ('Песня о друге','00:02:36',1),
	 ('Затяжной прыжок','00:04:18',2),
	 ('Спасите наши души','00:04:25',2),
	 ('Охота на волков','00:03:13',2),
	 ('Money','00:07:43',4),
	 ('Another brick in the wall','00:06:00',7),
	 ('Северный флот','00:02:11',5),
	 ('Камнем по голове','00:02:38',6),
	 ('Лесник','00:03:12',8),
	 ('One Of My Turns','00:03:45',7);
INSERT INTO public.collection (title,"year") VALUES
	 ('Лучшие песни группы Король и Шут',2024),
	 ('Памяти Владимира Высоцкого',2020),
	 ('Золотая коллекция рока',2005),
	 ('Золотая коллекция русского рока',2018),
	 ('Рок на века',2025);
INSERT INTO public.collection_track (collection_id,track_id) VALUES
	 (1,1),
	 (3,2),
	 (3,3),
	 (3,4),
	 (3,5),
	 (4,6),
	 (4,7),
	 (2,8),
	 (2,9),
	 (2,10),
	 (NULL,11),
	 (5,1),
	 (5,6),
	 (5,10);
INSERT INTO public.singer_genre (singer_id,genre_id) VALUES
	 (1,3),
	 (2,1),
	 (3,2),
	 (4,1),
	 (4,4);
INSERT INTO public.singer_album (singer_id,album_id) VALUES
	 (1,1),
	 (1,2),
	 (2,3),
	 (3,4),
	 (4,5),
	 (4,6),
	 (3,7),
	 (4,8);